SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG21/Include/efr32mg21_rac.h
/* Bit fields for RAC PATRIM1 */
#define _RAC_PATRIM1_RESETVALUE                                       0x40000980UL                                             /**< Default value for RAC_PATRIM1               */
#define _RAC_PATRIM1_MASK                                             0x7FFFFFFFUL                                             /**< Mask for RAC_PATRIM1                        */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_SHIFT                         0                                                        /**< Shift value for RAC_PATRIM10DBMDUTYCYN      */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_MASK                          0x7UL                                                    /**< Bit mask for RAC_PATRIM10DBMDUTYCYN         */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_DEFAULT                       0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_0pct                       0x00000000UL                                             /**< Mode up_0pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_1pct                       0x00000001UL                                             /**< Mode up_1pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_2pct                       0x00000002UL                                             /**< Mode up_2pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_3pct                       0x00000003UL                                             /**< Mode up_3pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_4pct                       0x00000004UL                                             /**< Mode up_4pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_5pct                       0x00000005UL                                             /**< Mode up_5pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_6pct                       0x00000006UL                                             /**< Mode up_6pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYN_na                            0x00000007UL                                             /**< Mode na for RAC_PATRIM1                     */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_DEFAULT                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_DEFAULT << 0)           /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_0pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_0pct << 0)           /**< Shifted mode up_0pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_1pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_1pct << 0)           /**< Shifted mode up_1pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_2pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_2pct << 0)           /**< Shifted mode up_2pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_3pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_3pct << 0)           /**< Shifted mode up_3pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_4pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_4pct << 0)           /**< Shifted mode up_4pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_5pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_5pct << 0)           /**< Shifted mode up_5pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_6pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_up_6pct << 0)           /**< Shifted mode up_6pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYN_na                             (_RAC_PATRIM1_PATRIM10DBMDUTYCYN_na << 0)                /**< Shifted mode na for RAC_PATRIM1             */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_SHIFT                         3                                                        /**< Shift value for RAC_PATRIM10DBMDUTYCYP      */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_MASK                          0x38UL                                                   /**< Bit mask for RAC_PATRIM10DBMDUTYCYP         */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_DEFAULT                       0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_0pct                       0x00000000UL                                             /**< Mode dn_0pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_1pct                       0x00000001UL                                             /**< Mode dn_1pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_2pct                       0x00000002UL                                             /**< Mode dn_2pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_3pct                       0x00000003UL                                             /**< Mode dn_3pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_4pct                       0x00000004UL                                             /**< Mode dn_4pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_5pct                       0x00000005UL                                             /**< Mode dn_5pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_6pct                       0x00000006UL                                             /**< Mode dn_6pct for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM10DBMDUTYCYP_na                            0x00000007UL                                             /**< Mode na for RAC_PATRIM1                     */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_DEFAULT                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_DEFAULT << 3)           /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_0pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_0pct << 3)           /**< Shifted mode dn_0pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_1pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_1pct << 3)           /**< Shifted mode dn_1pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_2pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_2pct << 3)           /**< Shifted mode dn_2pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_3pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_3pct << 3)           /**< Shifted mode dn_3pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_4pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_4pct << 3)           /**< Shifted mode dn_4pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_5pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_5pct << 3)           /**< Shifted mode dn_5pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_6pct                        (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_dn_6pct << 3)           /**< Shifted mode dn_6pct for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM10DBMDUTYCYP_na                             (_RAC_PATRIM1_PATRIM10DBMDUTYCYP_na << 3)                /**< Shifted mode na for RAC_PATRIM1             */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_SHIFT                          6                                                        /**< Shift value for RAC_PATRIM20DBMPREDRV       */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_MASK                           0x1C0UL                                                  /**< Bit mask for RAC_PATRIM20DBMPREDRV          */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_DEFAULT                        0x00000006UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_trise_137ps                    0x00000000UL                                             /**< Mode trise_137ps for RAC_PATRIM1            */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_trise_127ps                    0x00000001UL                                             /**< Mode trise_127ps for RAC_PATRIM1            */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_trise_117ps                    0x00000002UL                                             /**< Mode trise_117ps for RAC_PATRIM1            */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_trise_110ps                    0x00000003UL                                             /**< Mode trise_110ps for RAC_PATRIM1            */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_trise_75ps                     0x00000004UL                                             /**< Mode trise_75ps for RAC_PATRIM1             */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_trise_73ps                     0x00000005UL                                             /**< Mode trise_73ps for RAC_PATRIM1             */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_trise_71ps                     0x00000006UL                                             /**< Mode trise_71ps for RAC_PATRIM1             */
#define _RAC_PATRIM1_PATRIM20DBMPREDRV_trise_70ps                     0x00000007UL                                             /**< Mode trise_70ps for RAC_PATRIM1             */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_DEFAULT                         (_RAC_PATRIM1_PATRIM20DBMPREDRV_DEFAULT << 6)            /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_trise_137ps                     (_RAC_PATRIM1_PATRIM20DBMPREDRV_trise_137ps << 6)        /**< Shifted mode trise_137ps for RAC_PATRIM1    */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_trise_127ps                     (_RAC_PATRIM1_PATRIM20DBMPREDRV_trise_127ps << 6)        /**< Shifted mode trise_127ps for RAC_PATRIM1    */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_trise_117ps                     (_RAC_PATRIM1_PATRIM20DBMPREDRV_trise_117ps << 6)        /**< Shifted mode trise_117ps for RAC_PATRIM1    */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_trise_110ps                     (_RAC_PATRIM1_PATRIM20DBMPREDRV_trise_110ps << 6)        /**< Shifted mode trise_110ps for RAC_PATRIM1    */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_trise_75ps                      (_RAC_PATRIM1_PATRIM20DBMPREDRV_trise_75ps << 6)         /**< Shifted mode trise_75ps for RAC_PATRIM1     */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_trise_73ps                      (_RAC_PATRIM1_PATRIM20DBMPREDRV_trise_73ps << 6)         /**< Shifted mode trise_73ps for RAC_PATRIM1     */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_trise_71ps                      (_RAC_PATRIM1_PATRIM20DBMPREDRV_trise_71ps << 6)         /**< Shifted mode trise_71ps for RAC_PATRIM1     */
#define RAC_PATRIM1_PATRIM20DBMPREDRV_trise_70ps                      (_RAC_PATRIM1_PATRIM20DBMPREDRV_trise_70ps << 6)         /**< Shifted mode trise_70ps for RAC_PATRIM1     */
#define _RAC_PATRIM1_PATRIMANTSWBIAS_SHIFT                            9                                                        /**< Shift value for RAC_PATRIMANTSWBIAS         */
#define _RAC_PATRIM1_PATRIMANTSWBIAS_MASK                             0x600UL                                                  /**< Bit mask for RAC_PATRIMANTSWBIAS            */
#define _RAC_PATRIM1_PATRIMANTSWBIAS_DEFAULT                          0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd                        0x00000000UL                                             /**< Mode vb_at_vdd for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_mp6v                   0x00000001UL                                             /**< Mode vb_at_vdd_mp6v for RAC_PATRIM1         */
#define _RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_m1p2v                  0x00000002UL                                             /**< Mode vb_at_vdd_m1p2v for RAC_PATRIM1        */
#define _RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_m1p8v                  0x00000003UL                                             /**< Mode vb_at_vdd_m1p8v for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIMANTSWBIAS_DEFAULT                           (_RAC_PATRIM1_PATRIMANTSWBIAS_DEFAULT << 9)              /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd                         (_RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd << 9)            /**< Shifted mode vb_at_vdd for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_mp6v                    (_RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_mp6v << 9)       /**< Shifted mode vb_at_vdd_mp6v for RAC_PATRIM1 */
#define RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_m1p2v                   (_RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_m1p2v << 9)      /**< Shifted mode vb_at_vdd_m1p2v for RAC_PATRIM1*/
#define RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_m1p8v                   (_RAC_PATRIM1_PATRIMANTSWBIAS_vb_at_vdd_m1p8v << 9)      /**< Shifted mode vb_at_vdd_m1p8v for RAC_PATRIM1*/
#define RAC_PATRIM1_PATRIMBLEEDAUTOPREREG                             (0x1UL << 11)                                            /**< PATRIMBLEEDAUTOPREREG                       */
#define _RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_SHIFT                      11                                                       /**< Shift value for RAC_PATRIMBLEEDAUTOPREREG   */
#define _RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_MASK                       0x800UL                                                  /**< Bit mask for RAC_PATRIMBLEEDAUTOPREREG      */
#define _RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_DEFAULT                    0x00000001UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_not_automatic              0x00000000UL                                             /**< Mode not_automatic for RAC_PATRIM1          */
#define _RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_automatic                  0x00000001UL                                             /**< Mode automatic for RAC_PATRIM1              */
#define RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_DEFAULT                     (_RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_DEFAULT << 11)       /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_not_automatic               (_RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_not_automatic << 11) /**< Shifted mode not_automatic for RAC_PATRIM1  */
#define RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_automatic                   (_RAC_PATRIM1_PATRIMBLEEDAUTOPREREG_automatic << 11)     /**< Shifted mode automatic for RAC_PATRIM1      */
#define _RAC_PATRIM1_PATRIMCAPPAOUTM_SHIFT                            12                                                       /**< Shift value for RAC_PATRIMCAPPAOUTM         */
#define _RAC_PATRIM1_PATRIMCAPPAOUTM_MASK                             0xF000UL                                                 /**< Bit mask for RAC_PATRIMCAPPAOUTM            */
#define _RAC_PATRIM1_PATRIMCAPPAOUTM_DEFAULT                          0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define RAC_PATRIM1_PATRIMCAPPAOUTM_DEFAULT                           (_RAC_PATRIM1_PATRIMCAPPAOUTM_DEFAULT << 12)             /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define _RAC_PATRIM1_PATRIMCAPPAOUTP_SHIFT                            16                                                       /**< Shift value for RAC_PATRIMCAPPAOUTP         */
#define _RAC_PATRIM1_PATRIMCAPPAOUTP_MASK                             0xF0000UL                                                /**< Bit mask for RAC_PATRIMCAPPAOUTP            */
#define _RAC_PATRIM1_PATRIMCAPPAOUTP_DEFAULT                          0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define RAC_PATRIM1_PATRIMCAPPAOUTP_DEFAULT                           (_RAC_PATRIM1_PATRIMCAPPAOUTP_DEFAULT << 16)             /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define _RAC_PATRIM1_PATRIMCMGAIN_SHIFT                               20                                                       /**< Shift value for RAC_PATRIMCMGAIN            */
#define _RAC_PATRIM1_PATRIMCMGAIN_MASK                                0x300000UL                                               /**< Bit mask for RAC_PATRIMCMGAIN               */
#define _RAC_PATRIM1_PATRIMCMGAIN_DEFAULT                             0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define RAC_PATRIM1_PATRIMCMGAIN_DEFAULT                              (_RAC_PATRIM1_PATRIMCMGAIN_DEFAULT << 20)                /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define _RAC_PATRIM1_PATRIMDLY0_SHIFT                                 22                                                       /**< Shift value for RAC_PATRIMDLY0              */
#define _RAC_PATRIM1_PATRIMDLY0_MASK                                  0x1C00000UL                                              /**< Bit mask for RAC_PATRIMDLY0                 */
#define _RAC_PATRIM1_PATRIMDLY0_DEFAULT                               0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIMDLY0_tdly_0ps                              0x00000000UL                                             /**< Mode tdly_0ps for RAC_PATRIM1               */
#define _RAC_PATRIM1_PATRIMDLY0_tdly_64ps                             0x00000001UL                                             /**< Mode tdly_64ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY0_tdly_65ps                             0x00000002UL                                             /**< Mode tdly_65ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY0_tdly_66ps                             0x00000003UL                                             /**< Mode tdly_66ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY0_tdly_68ps                             0x00000004UL                                             /**< Mode tdly_68ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY0_tdly_70ps                             0x00000005UL                                             /**< Mode tdly_70ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY0_tdly_75ps                             0x00000006UL                                             /**< Mode tdly_75ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY0_tdly_83ps                             0x00000007UL                                             /**< Mode tdly_83ps for RAC_PATRIM1              */
#define RAC_PATRIM1_PATRIMDLY0_DEFAULT                                (_RAC_PATRIM1_PATRIMDLY0_DEFAULT << 22)                  /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIMDLY0_tdly_0ps                               (_RAC_PATRIM1_PATRIMDLY0_tdly_0ps << 22)                 /**< Shifted mode tdly_0ps for RAC_PATRIM1       */
#define RAC_PATRIM1_PATRIMDLY0_tdly_64ps                              (_RAC_PATRIM1_PATRIMDLY0_tdly_64ps << 22)                /**< Shifted mode tdly_64ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY0_tdly_65ps                              (_RAC_PATRIM1_PATRIMDLY0_tdly_65ps << 22)                /**< Shifted mode tdly_65ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY0_tdly_66ps                              (_RAC_PATRIM1_PATRIMDLY0_tdly_66ps << 22)                /**< Shifted mode tdly_66ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY0_tdly_68ps                              (_RAC_PATRIM1_PATRIMDLY0_tdly_68ps << 22)                /**< Shifted mode tdly_68ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY0_tdly_70ps                              (_RAC_PATRIM1_PATRIMDLY0_tdly_70ps << 22)                /**< Shifted mode tdly_70ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY0_tdly_75ps                              (_RAC_PATRIM1_PATRIMDLY0_tdly_75ps << 22)                /**< Shifted mode tdly_75ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY0_tdly_83ps                              (_RAC_PATRIM1_PATRIMDLY0_tdly_83ps << 22)                /**< Shifted mode tdly_83ps for RAC_PATRIM1      */
#define _RAC_PATRIM1_PATRIMDLY1_SHIFT                                 25                                                       /**< Shift value for RAC_PATRIMDLY1              */
#define _RAC_PATRIM1_PATRIMDLY1_MASK                                  0xE000000UL                                              /**< Bit mask for RAC_PATRIMDLY1                 */
#define _RAC_PATRIM1_PATRIMDLY1_DEFAULT                               0x00000000UL                                             /**< Mode DEFAULT for RAC_PATRIM1                */
#define _RAC_PATRIM1_PATRIMDLY1_tdly_0ps                              0x00000000UL                                             /**< Mode tdly_0ps for RAC_PATRIM1               */
#define _RAC_PATRIM1_PATRIMDLY1_tdly_64ps                             0x00000001UL                                             /**< Mode tdly_64ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY1_tdly_65ps                             0x00000002UL                                             /**< Mode tdly_65ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY1_tdly_66ps                             0x00000003UL                                             /**< Mode tdly_66ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY1_tdly_68ps                             0x00000004UL                                             /**< Mode tdly_68ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY1_tdly_70ps                             0x00000005UL                                             /**< Mode tdly_70ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY1_tdly_75ps                             0x00000006UL                                             /**< Mode tdly_75ps for RAC_PATRIM1              */
#define _RAC_PATRIM1_PATRIMDLY1_tdly_83ps                             0x00000007UL                                             /**< Mode tdly_83ps for RAC_PATRIM1              */
#define RAC_PATRIM1_PATRIMDLY1_DEFAULT                                (_RAC_PATRIM1_PATRIMDLY1_DEFAULT << 25)                  /**< Shifted mode DEFAULT for RAC_PATRIM1        */
#define RAC_PATRIM1_PATRIMDLY1_tdly_0ps                               (_RAC_PATRIM1_PATRIMDLY1_tdly_0ps << 25)                 /**< Shifted mode tdly_0ps for RAC_PATRIM1       */
#define RAC_PATRIM1_PATRIMDLY1_tdly_64ps                              (_RAC_PATRIM1_PATRIMDLY1_tdly_64ps << 25)                /**< Shifted mode tdly_64ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY1_tdly_65ps                              (_RAC_PATRIM1_PATRIMDLY1_tdly_65ps << 25)                /**< Shifted mode tdly_65ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY1_tdly_66ps                              (_RAC_PATRIM1_PATRIMDLY1_tdly_66ps << 25)                /**< Shifted mode tdly_66ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY1_tdly_68ps                              (_RAC_PATRIM1_PATRIMDLY1_tdly_68ps << 25)                /**< Shifted mode tdly_68ps for RAC_PATRIM1      */
#define RAC_PATRIM1_PATRIMDLY1_tdly_70ps                              (_RAC_PATRIM1_PATRIMDLY1_tdly_70ps << 25)                /**< Shifted mode tdly_70ps for RAC_PATRIM1      */
