SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG21/Include/efr32mg21_rac.h
/* Bit fields for RAC PACTRL */
#define _RAC_PACTRL_RESETVALUE                                        0x00000000UL                                       /**< Default value for RAC_PACTRL                */
#define _RAC_PACTRL_MASK                                              0x00FF07FFUL                                       /**< Mask for RAC_PACTRL                         */
#define RAC_PACTRL_PAEN10DBMVMID                                      (0x1UL << 0)                                       /**< PAEN10DBMVMID                               */
#define _RAC_PACTRL_PAEN10DBMVMID_SHIFT                               0                                                  /**< Shift value for RAC_PAEN10DBMVMID           */
#define _RAC_PACTRL_PAEN10DBMVMID_MASK                                0x1UL                                              /**< Bit mask for RAC_PAEN10DBMVMID              */
#define _RAC_PACTRL_PAEN10DBMVMID_DEFAULT                             0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAEN10DBMVMID_disable                             0x00000000UL                                       /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_PAEN10DBMVMID_enable                              0x00000001UL                                       /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_PAEN10DBMVMID_DEFAULT                              (_RAC_PACTRL_PAEN10DBMVMID_DEFAULT << 0)           /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAEN10DBMVMID_disable                              (_RAC_PACTRL_PAEN10DBMVMID_disable << 0)           /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_PAEN10DBMVMID_enable                               (_RAC_PACTRL_PAEN10DBMVMID_enable << 0)            /**< Shifted mode enable for RAC_PACTRL          */
#define RAC_PACTRL_PAEN20DBMVMID                                      (0x1UL << 1)                                       /**< PAEN20DBMVMID                               */
#define _RAC_PACTRL_PAEN20DBMVMID_SHIFT                               1                                                  /**< Shift value for RAC_PAEN20DBMVMID           */
#define _RAC_PACTRL_PAEN20DBMVMID_MASK                                0x2UL                                              /**< Bit mask for RAC_PAEN20DBMVMID              */
#define _RAC_PACTRL_PAEN20DBMVMID_DEFAULT                             0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAEN20DBMVMID_disable                             0x00000000UL                                       /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_PAEN20DBMVMID_enable                              0x00000001UL                                       /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_PAEN20DBMVMID_DEFAULT                              (_RAC_PACTRL_PAEN20DBMVMID_DEFAULT << 1)           /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAEN20DBMVMID_disable                              (_RAC_PACTRL_PAEN20DBMVMID_disable << 1)           /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_PAEN20DBMVMID_enable                               (_RAC_PACTRL_PAEN20DBMVMID_enable << 1)            /**< Shifted mode enable for RAC_PACTRL          */
#define RAC_PACTRL_PAENCAPATT                                         (0x1UL << 2)                                       /**< PAENCAPATT                                  */
#define _RAC_PACTRL_PAENCAPATT_SHIFT                                  2                                                  /**< Shift value for RAC_PAENCAPATT              */
#define _RAC_PACTRL_PAENCAPATT_MASK                                   0x4UL                                              /**< Bit mask for RAC_PAENCAPATT                 */
#define _RAC_PACTRL_PAENCAPATT_DEFAULT                                0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAENCAPATT_disable                                0x00000000UL                                       /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_PAENCAPATT_enable                                 0x00000001UL                                       /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_PAENCAPATT_DEFAULT                                 (_RAC_PACTRL_PAENCAPATT_DEFAULT << 2)              /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAENCAPATT_disable                                 (_RAC_PACTRL_PAENCAPATT_disable << 2)              /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_PAENCAPATT_enable                                  (_RAC_PACTRL_PAENCAPATT_enable << 2)               /**< Shifted mode enable for RAC_PACTRL          */
#define RAC_PACTRL_PAENLATCHBYPASS                                    (0x1UL << 3)                                       /**< PAENLATCHBYPASS                             */
#define _RAC_PACTRL_PAENLATCHBYPASS_SHIFT                             3                                                  /**< Shift value for RAC_PAENLATCHBYPASS         */
#define _RAC_PACTRL_PAENLATCHBYPASS_MASK                              0x8UL                                              /**< Bit mask for RAC_PAENLATCHBYPASS            */
#define _RAC_PACTRL_PAENLATCHBYPASS_DEFAULT                           0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAENLATCHBYPASS_disable                           0x00000000UL                                       /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_PAENLATCHBYPASS_enable                            0x00000001UL                                       /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_PAENLATCHBYPASS_DEFAULT                            (_RAC_PACTRL_PAENLATCHBYPASS_DEFAULT << 3)         /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAENLATCHBYPASS_disable                            (_RAC_PACTRL_PAENLATCHBYPASS_disable << 3)         /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_PAENLATCHBYPASS_enable                             (_RAC_PACTRL_PAENLATCHBYPASS_enable << 3)          /**< Shifted mode enable for RAC_PACTRL          */
#define RAC_PACTRL_PAENPOWERRAMPINGCLK                                (0x1UL << 4)                                       /**< PAENPOWERRAMPINGCLK                         */
#define _RAC_PACTRL_PAENPOWERRAMPINGCLK_SHIFT                         4                                                  /**< Shift value for RAC_PAENPOWERRAMPINGCLK     */
#define _RAC_PACTRL_PAENPOWERRAMPINGCLK_MASK                          0x10UL                                             /**< Bit mask for RAC_PAENPOWERRAMPINGCLK        */
#define _RAC_PACTRL_PAENPOWERRAMPINGCLK_DEFAULT                       0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAENPOWERRAMPINGCLK_silence_clk                   0x00000000UL                                       /**< Mode silence_clk for RAC_PACTRL             */
#define _RAC_PACTRL_PAENPOWERRAMPINGCLK_en_clk                        0x00000001UL                                       /**< Mode en_clk for RAC_PACTRL                  */
#define RAC_PACTRL_PAENPOWERRAMPINGCLK_DEFAULT                        (_RAC_PACTRL_PAENPOWERRAMPINGCLK_DEFAULT << 4)     /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAENPOWERRAMPINGCLK_silence_clk                    (_RAC_PACTRL_PAENPOWERRAMPINGCLK_silence_clk << 4) /**< Shifted mode silence_clk for RAC_PACTRL     */
#define RAC_PACTRL_PAENPOWERRAMPINGCLK_en_clk                         (_RAC_PACTRL_PAENPOWERRAMPINGCLK_en_clk << 4)      /**< Shifted mode en_clk for RAC_PACTRL          */
#define RAC_PACTRL_PAPULLDOWNVDDPA                                    (0x1UL << 5)                                       /**< PAPULLDOWNVDDPA                             */
#define _RAC_PACTRL_PAPULLDOWNVDDPA_SHIFT                             5                                                  /**< Shift value for RAC_PAPULLDOWNVDDPA         */
#define _RAC_PACTRL_PAPULLDOWNVDDPA_MASK                              0x20UL                                             /**< Bit mask for RAC_PAPULLDOWNVDDPA            */
#define _RAC_PACTRL_PAPULLDOWNVDDPA_DEFAULT                           0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAPULLDOWNVDDPA_not_pull_down                     0x00000000UL                                       /**< Mode not_pull_down for RAC_PACTRL           */
#define _RAC_PACTRL_PAPULLDOWNVDDPA_pull_down_vddpa                   0x00000001UL                                       /**< Mode pull_down_vddpa for RAC_PACTRL         */
#define RAC_PACTRL_PAPULLDOWNVDDPA_DEFAULT                            (_RAC_PACTRL_PAPULLDOWNVDDPA_DEFAULT << 5)         /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAPULLDOWNVDDPA_not_pull_down                      (_RAC_PACTRL_PAPULLDOWNVDDPA_not_pull_down << 5)   /**< Shifted mode not_pull_down for RAC_PACTRL   */
#define RAC_PACTRL_PAPULLDOWNVDDPA_pull_down_vddpa                    (_RAC_PACTRL_PAPULLDOWNVDDPA_pull_down_vddpa << 5) /**< Shifted mode pull_down_vddpa for RAC_PACTRL */
#define RAC_PACTRL_PAREGBYPASSPDRVLDO                                 (0x1UL << 6)                                       /**< PAREGBYPASSPDRVLDO                          */
#define _RAC_PACTRL_PAREGBYPASSPDRVLDO_SHIFT                          6                                                  /**< Shift value for RAC_PAREGBYPASSPDRVLDO      */
#define _RAC_PACTRL_PAREGBYPASSPDRVLDO_MASK                           0x40UL                                             /**< Bit mask for RAC_PAREGBYPASSPDRVLDO         */
#define _RAC_PACTRL_PAREGBYPASSPDRVLDO_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAREGBYPASSPDRVLDO_not_bypass                     0x00000000UL                                       /**< Mode not_bypass for RAC_PACTRL              */
#define _RAC_PACTRL_PAREGBYPASSPDRVLDO_bypass                         0x00000001UL                                       /**< Mode bypass for RAC_PACTRL                  */
#define RAC_PACTRL_PAREGBYPASSPDRVLDO_DEFAULT                         (_RAC_PACTRL_PAREGBYPASSPDRVLDO_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAREGBYPASSPDRVLDO_not_bypass                      (_RAC_PACTRL_PAREGBYPASSPDRVLDO_not_bypass << 6)   /**< Shifted mode not_bypass for RAC_PACTRL      */
#define RAC_PACTRL_PAREGBYPASSPDRVLDO_bypass                          (_RAC_PACTRL_PAREGBYPASSPDRVLDO_bypass << 6)       /**< Shifted mode bypass for RAC_PACTRL          */
#define RAC_PACTRL_PAREGBYPASSPREREG                                  (0x1UL << 7)                                       /**< PAREGBYPASSPREREG                           */
#define _RAC_PACTRL_PAREGBYPASSPREREG_SHIFT                           7                                                  /**< Shift value for RAC_PAREGBYPASSPREREG       */
#define _RAC_PACTRL_PAREGBYPASSPREREG_MASK                            0x80UL                                             /**< Bit mask for RAC_PAREGBYPASSPREREG          */
#define _RAC_PACTRL_PAREGBYPASSPREREG_DEFAULT                         0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAREGBYPASSPREREG_not_bypass                      0x00000000UL                                       /**< Mode not_bypass for RAC_PACTRL              */
#define _RAC_PACTRL_PAREGBYPASSPREREG_bypass                          0x00000001UL                                       /**< Mode bypass for RAC_PACTRL                  */
#define RAC_PACTRL_PAREGBYPASSPREREG_DEFAULT                          (_RAC_PACTRL_PAREGBYPASSPREREG_DEFAULT << 7)       /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAREGBYPASSPREREG_not_bypass                       (_RAC_PACTRL_PAREGBYPASSPREREG_not_bypass << 7)    /**< Shifted mode not_bypass for RAC_PACTRL      */
#define RAC_PACTRL_PAREGBYPASSPREREG_bypass                           (_RAC_PACTRL_PAREGBYPASSPREREG_bypass << 7)        /**< Shifted mode bypass for RAC_PACTRL          */
#define RAC_PACTRL_PASELLDOVDDPA                                      (0x1UL << 8)                                       /**< PASELLDOVDDPA                               */
#define _RAC_PACTRL_PASELLDOVDDPA_SHIFT                               8                                                  /**< Shift value for RAC_PASELLDOVDDPA           */
#define _RAC_PACTRL_PASELLDOVDDPA_MASK                                0x100UL                                            /**< Bit mask for RAC_PASELLDOVDDPA              */
#define _RAC_PACTRL_PASELLDOVDDPA_DEFAULT                             0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PASELLDOVDDPA_not_selected                        0x00000000UL                                       /**< Mode not_selected for RAC_PACTRL            */
#define _RAC_PACTRL_PASELLDOVDDPA_selected                            0x00000001UL                                       /**< Mode selected for RAC_PACTRL                */
#define RAC_PACTRL_PASELLDOVDDPA_DEFAULT                              (_RAC_PACTRL_PASELLDOVDDPA_DEFAULT << 8)           /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PASELLDOVDDPA_not_selected                         (_RAC_PACTRL_PASELLDOVDDPA_not_selected << 8)      /**< Shifted mode not_selected for RAC_PACTRL    */
#define RAC_PACTRL_PASELLDOVDDPA_selected                             (_RAC_PACTRL_PASELLDOVDDPA_selected << 8)          /**< Shifted mode selected for RAC_PACTRL        */
#define RAC_PACTRL_PASELLDOVDDRF                                      (0x1UL << 9)                                       /**< PASELLDOVDDRF                               */
#define _RAC_PACTRL_PASELLDOVDDRF_SHIFT                               9                                                  /**< Shift value for RAC_PASELLDOVDDRF           */
#define _RAC_PACTRL_PASELLDOVDDRF_MASK                                0x200UL                                            /**< Bit mask for RAC_PASELLDOVDDRF              */
#define _RAC_PACTRL_PASELLDOVDDRF_DEFAULT                             0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PASELLDOVDDRF_not_selected                        0x00000000UL                                       /**< Mode not_selected for RAC_PACTRL            */
#define _RAC_PACTRL_PASELLDOVDDRF_selected                            0x00000001UL                                       /**< Mode selected for RAC_PACTRL                */
#define RAC_PACTRL_PASELLDOVDDRF_DEFAULT                              (_RAC_PACTRL_PASELLDOVDDRF_DEFAULT << 9)           /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PASELLDOVDDRF_not_selected                         (_RAC_PACTRL_PASELLDOVDDRF_not_selected << 9)      /**< Shifted mode not_selected for RAC_PACTRL    */
#define RAC_PACTRL_PASELLDOVDDRF_selected                             (_RAC_PACTRL_PASELLDOVDDRF_selected << 9)          /**< Shifted mode selected for RAC_PACTRL        */
#define RAC_PACTRL_PASLICERST                                         (0x1UL << 10)                                      /**< PASLICERST                                  */
#define _RAC_PACTRL_PASLICERST_SHIFT                                  10                                                 /**< Shift value for RAC_PASLICERST              */
#define _RAC_PACTRL_PASLICERST_MASK                                   0x400UL                                            /**< Bit mask for RAC_PASLICERST                 */
#define _RAC_PACTRL_PASLICERST_DEFAULT                                0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PASLICERST_disable                                0x00000000UL                                       /**< Mode disable for RAC_PACTRL                 */
#define _RAC_PACTRL_PASLICERST_enable                                 0x00000001UL                                       /**< Mode enable for RAC_PACTRL                  */
#define RAC_PACTRL_PASLICERST_DEFAULT                                 (_RAC_PACTRL_PASLICERST_DEFAULT << 10)             /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PASLICERST_disable                                 (_RAC_PACTRL_PASLICERST_disable << 10)             /**< Shifted mode disable for RAC_PACTRL         */
#define RAC_PACTRL_PASLICERST_enable                                  (_RAC_PACTRL_PASLICERST_enable << 10)              /**< Shifted mode enable for RAC_PACTRL          */
#define _RAC_PACTRL_PAPOWER_SHIFT                                     16                                                 /**< Shift value for RAC_PAPOWER                 */
#define _RAC_PACTRL_PAPOWER_MASK                                      0xF0000UL                                          /**< Bit mask for RAC_PAPOWER                    */
#define _RAC_PACTRL_PAPOWER_DEFAULT                                   0x00000000UL                                       /**< Mode DEFAULT for RAC_PACTRL                 */
#define _RAC_PACTRL_PAPOWER_t0stripeon                                0x00000000UL                                       /**< Mode t0stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t1stripeon                                0x00000001UL                                       /**< Mode t1stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t2stripeon                                0x00000002UL                                       /**< Mode t2stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t3stripeon                                0x00000003UL                                       /**< Mode t3stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t4stripeon                                0x00000004UL                                       /**< Mode t4stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t5stripeon                                0x00000005UL                                       /**< Mode t5stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t6stripeon                                0x00000006UL                                       /**< Mode t6stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t7stripeon                                0x00000007UL                                       /**< Mode t7stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t8stripeon                                0x00000008UL                                       /**< Mode t8stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t9stripeon                                0x00000009UL                                       /**< Mode t9stripeon for RAC_PACTRL              */
#define _RAC_PACTRL_PAPOWER_t10stripeon                               0x0000000AUL                                       /**< Mode t10stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_PAPOWER_t11stripeon                               0x0000000BUL                                       /**< Mode t11stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_PAPOWER_t12stripeon                               0x0000000CUL                                       /**< Mode t12stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_PAPOWER_t13stripeon                               0x0000000DUL                                       /**< Mode t13stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_PAPOWER_t14stripeon                               0x0000000EUL                                       /**< Mode t14stripeon for RAC_PACTRL             */
#define _RAC_PACTRL_PAPOWER_t15stripeon                               0x0000000FUL                                       /**< Mode t15stripeon for RAC_PACTRL             */
#define RAC_PACTRL_PAPOWER_DEFAULT                                    (_RAC_PACTRL_PAPOWER_DEFAULT << 16)                /**< Shifted mode DEFAULT for RAC_PACTRL         */
#define RAC_PACTRL_PAPOWER_t0stripeon                                 (_RAC_PACTRL_PAPOWER_t0stripeon << 16)             /**< Shifted mode t0stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t1stripeon                                 (_RAC_PACTRL_PAPOWER_t1stripeon << 16)             /**< Shifted mode t1stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t2stripeon                                 (_RAC_PACTRL_PAPOWER_t2stripeon << 16)             /**< Shifted mode t2stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t3stripeon                                 (_RAC_PACTRL_PAPOWER_t3stripeon << 16)             /**< Shifted mode t3stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t4stripeon                                 (_RAC_PACTRL_PAPOWER_t4stripeon << 16)             /**< Shifted mode t4stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t5stripeon                                 (_RAC_PACTRL_PAPOWER_t5stripeon << 16)             /**< Shifted mode t5stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t6stripeon                                 (_RAC_PACTRL_PAPOWER_t6stripeon << 16)             /**< Shifted mode t6stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t7stripeon                                 (_RAC_PACTRL_PAPOWER_t7stripeon << 16)             /**< Shifted mode t7stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t8stripeon                                 (_RAC_PACTRL_PAPOWER_t8stripeon << 16)             /**< Shifted mode t8stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t9stripeon                                 (_RAC_PACTRL_PAPOWER_t9stripeon << 16)             /**< Shifted mode t9stripeon for RAC_PACTRL      */
#define RAC_PACTRL_PAPOWER_t10stripeon                                (_RAC_PACTRL_PAPOWER_t10stripeon << 16)            /**< Shifted mode t10stripeon for RAC_PACTRL     */
#define RAC_PACTRL_PAPOWER_t11stripeon                                (_RAC_PACTRL_PAPOWER_t11stripeon << 16)            /**< Shifted mode t11stripeon for RAC_PACTRL     */
#define RAC_PACTRL_PAPOWER_t12stripeon                                (_RAC_PACTRL_PAPOWER_t12stripeon << 16)            /**< Shifted mode t12stripeon for RAC_PACTRL     */
#define RAC_PACTRL_PAPOWER_t13stripeon                                (_RAC_PACTRL_PAPOWER_t13stripeon << 16)            /**< Shifted mode t13stripeon for RAC_PACTRL     */
#define RAC_PACTRL_PAPOWER_t14stripeon                                (_RAC_PACTRL_PAPOWER_t14stripeon << 16)            /**< Shifted mode t14stripeon for RAC_PACTRL     */
#define RAC_PACTRL_PAPOWER_t15stripeon                                (_RAC_PACTRL_PAPOWER_t15stripeon << 16)            /**< Shifted mode t15stripeon for RAC_PACTRL     */
#define _RAC_PACTRL_PASELSLICE_SHIFT                                  20                                                 /**< Shift value for RAC_PASELSLICE              */
